Tekla Open API Reference for Tekla Structures 2025
ProfileItemSubType Properties
The ProfileItemSubType type exposes the following members.
Properties
Name | Description
BitmapName
 Gets a value of the property BitmapName.
Label
 Gets a value of the property Label.
ParameterString
 Gets a value of the property ParameterString.
SubTypeId
 Gets a value of the property SubTypeId.
Top
See Also
Reference
ProfileItemSubType Class
Tekla.Structures.Catalogs Namespace